<font size="6"><strong>Mathematische Ausdr&uuml;cke:</strong></font><br><br>

MathTool versteht mathematische Ausdr&uuml;cke. Hierbei werden die vier Grundrechenarten mit +, -, * und / angegeben, Potenzen durch ^. Mathematische Funktionen tragen ihre &uuml;blichen Namen, z.B. sin(...), exp(...), ln(...), arctan(...) etc. Eine 
Liste mit allen Funktionen finden Sie weiter unten.<br>
<em>Wichtig:</em> Multiplikationen m&uuml;ssen stets durch ein * angegeben werden. MathTool versteht den Ausdruck 2*x, dagegen jedoch 2x nicht und gibt dementsprechend einen Fehler aus.<br>
G&uuml;ltige Ausdr&uuml;cke sehen dann etwa wie folgt aus:<br><br>

3*x + y^5, -a + 6*exp(2 + cos(z^4)), ...<br><br>

Ein eingegebener mathematischer Ausdruck wird von MathTool sofort in vereinfachter Form ausgegeben, sofern dies m&ouml;glich ist. Dies kann jedoch zu verlängerten Wartezeiten führen, falls der Ausdruck zu kompliziert ist und eine Vereinfachung viel zu lange dauert.<br><br>

In MathTool k&ouml;nnen Ver&auml;nderliche mit einem einfachen Kleinbuchstaben oder mit einem Kleinbuchstaben mit Index bezeichnet werden. Ebenso sind im Anschluss beliebig viele ' erlaubt. 
G&uuml;ltige Variablen sind demnach etwa<br><br>

a, b, c, ..., x, y, ..., a_1, x_18, ..., y', a_2', ... <br><br>

nicht aber etwa xy, abc oder a'_1'. Der Apostroph suggeriert hierbei eine Ableitung, die aber nur dann zum Tragen kommt, wenn es um <i>Differentialgleichungen</i> geht. Ansonsten dient er zur Variablenunterscheidung. 
Die Konstante pi bezeichnet die Kreiszahl &#960; und kann selbstverst&auml;ndlich nicht mittels Befehl def() (s. Abschnitt Befehle) umdefiniert werden. Beachten Sie, dass MathTool beim Kompilieren eines 
mathematischen Ausdrucks Leerzeichen beseitigt und Gro&szlig;buchstaben zu Kleinbuchstaben macht. Insofern ist beispielsweise die Ver&auml;nderliche A_3 dasselbe wie a_3.<br><br>

<strong>Liste aller Funktionen:</strong><br><br>
<strong>abs(x):</strong> Berechnet den Absolutbetrag von x.<br><br>
<strong>arccosec(x):</strong> Berechnet den Arkuskosecans von x (in Bogenma&szlig;).<br><br>
<strong>arccot(x):</strong> Berechnet den Arkuskotangens von x (in Bogenma&szlig;).<br><br>
<strong>arcsec(x):</strong> Berechnet den Arkussecans von x (in Bogenma&szlig;).<br><br>
<strong>arcsin(x):</strong> Berechnet den Arkussinus von x (in Bogenma&szlig;).<br><br>
<strong>arctan(x):</strong> Berechnet den Arkustangens von x (in Bogenma&szlig;).<br><br>
<strong>arcosh(x):</strong> Berechnet den Areakosinus Hyperbolicus von x.<br><br>
<strong>arcosech(x):</strong> Berechnet den Areakosecans Hyperbolicus von x.<br><br>
<strong>arcoth(x):</strong> Berechnet den Areakotangens Hyperbolicus von x.<br><br>
<strong>arsech(x):</strong> Berechnet den Areasecans Hyperbolicus von x.<br><br>
<strong>arsinh(x):</strong> Berechnet den Areasinus Hyperbolicus von x.<br><br>
<strong>artanh(x):</strong> Berechnet den Areatangens Hyperbolicus von x.<br><br>
<strong>cos(x):</strong> Berechnet den Kosinus von x (x in Bogenma&szlig;).<br><br>
<strong>cosh(x):</strong> Berechnet den Kosinus Hyperbolicus von x.<br><br>
<strong>cosec(x):</strong> Berechnet den Kosecans von x (x in Bogenma&szlig;).<br><br>
<strong>cosech(x):</strong> Berechnet den Kosecans Hyperbolicus von x.<br><br>
<strong>cot(x):</strong> Berechnet den Kotangens von x (x in Bogenma&szlig;).<br><br>
<strong>coth(x):</strong> Berechnet den Kotangens Hyperbolucus von x.<br><br>
<strong>exp(x):</strong> Berechnet die Exponentialfunktion von x.<br><br>
<strong>lg(x):</strong> Berechnet den Logarithmus von x zur Basis 10.<br><br>
<strong>ln(x):</strong> Berechnet den nat&uuml;rlichen Logarithmus von x.<br><br>
<strong>sgn(x):</strong> Berechnet das Signum von x.<br><br>
<strong>sin(x):</strong> Berechnet den Sinus von x (x in Bogenma&szlig;).<br><br>
<strong>sinh(x):</strong> Berechnet den Sinus Hyperbolicus von x.<br><br>
<strong>sec(x):</strong> Berechnet den Secans von x (x in Bogenma&szlig;).<br><br>
<strong>sech(x):</strong> Berechnet den Secans Hyperbolicus von x.<br><br>
<strong>tan(x):</strong> Berechnet den Tangens von x (x in Bogenma&szlig;).<br><br>
<strong>tanh(x):</strong> Berechnet den Tangens Hyperbolicus von x.<br><br>

